Repository: quoffie/soda-full
Catalog: profiles/soda/modules/contrib/dbee/translations/*.po
Languages: fr

source: DataBase Email Encryption module
fr: Module DataBase Email Encryption

source: All email addresses are encrypted now
fr: Toutes les adresses mails sont désormais cryptées

source: Allow to loggin using email address
fr: Autorise à se connecter en utilisant l'adresse mail

source: This feature is handled by the %module module.
fr: Cette fonctionnalité est gérée par le module %module.

source: Enable this feature only if you meet performance troubles on the user search.
fr: Activez cette fonctionnalité uniquement si vous rencontrez des problèmes de performance concernant la recherche d'utilisateur.

source: Thoses performance troubles may occures on one specific situation :
fr: Ces problèmes de performance peuvent apparaître dans une situation spécifique :

source: <a href="@url">Searching a user</a>,
fr: <a href="@url">En recherchant un utilisateur</a>,

source: by a connected user granted with the 'administer users' permission,
fr: Par un utilisateur authentifié avec la permission « Administrer les utilisateurs »,

source: on a site with a lot of register users.
fr: sur un site avec beaucoup d'utilisateurs enregistrés.

source: As a limitation, only completed emails will be finded. As an example, on site storing a user with the 'john@example.com' mail value, if this checkbox is checked, searching this user using the key word 'hn@examp' will fail but the whole email address search key 'john@example.com' will succeed. In both cases, the result will be returned very fast.
fr: Comme limitation, seules les adresses mail complètes seront trouvées. Par exemple, sur un site contenant un utilisateur avec comme adresse email « john@example.com », si cette case est cochée, la recherche de cet utilisateur avec le mot clef « hn@examp » échouera tandis que la recherche avec le mot clef de l'adresse mail complète « john@example.com » réussira. Dans les deux cas, le résultat sera renvoyé très rapidement.

source: Disable searching users via uncompleted email address.
fr: Désactiver la recherche d'utilisateurs par adresses emails incomplètes.

source: Save
fr: Enregistrer

source: The '%setting' setting is not valid
fr: Le paramètre « %setting » n'est pas valide

source: New setting has been saved
fr: Les nouveaux paramètres ont étés sauvés

source: Administer database email encryption
fr: Administrer database email encryption

source: Configure options for the 'database email encryption' module
fr: Configure les options pour le module « database email encryption »

source: All users email addresses have been %crypted (concerning @updated_users of @total_users users)
fr: Toutes les adresses emails ont été %crypted (pour @updated_users sur @total_users utilisateurs)

source: encrypted
fr: cryptées

source: decrypted
fr: décryptées

source: No email address registered for %name.
fr: Pas d'adresse mail enregistrée pour l'utilisateur %name.

source: The %name's email address is encrypted.
fr: L'adresse mail de %name est cryptée.

source: The %name's email address is encrypted but corrupted. Sending email will be a failure.
fr: L'adresse mail de %name est cryptée mais corrompue. L'envoi de mail échouera.

source: The %name's email address is not encrypted.
fr: L'adresse mail de %name n'est pas cryptée.

source: Security
fr: Sécurité

source: Contact email
fr: Email de contact

source: The name %name is already taken.
fr: Le nom %name est déjà pris.

source: The e-mail address %email is already taken.
fr: L'adresse e-mail %email est déja utilisée.

source: The e-mail address %email is already registered. <a href="@password">Have you forgotten your password?</a>
fr: L'adresse électronique %email est déjà enregistrée. <a href="@password">Avez-vous oublié votre mot de passe ?</a>

source: The signature is too long: it must be %max characters or less.
fr: La signature est trop longue : elle doit contenir %max caractères ou moins.

source: DataBase Email Encryption module enabled
fr: Module DataBase Email Encryption activé

source: Encryption is enabled now. Check AES encryption method on the <a href="@url">AES settings page</a>
fr: Le cryptage est désormais actif. Controlez la méthode de cryptage AES sur la <a href="@url">page des paramètres AES</a>

source: The <a href="@url" title="More information on the AES setting page">AES password feature</a> has been disabled
fr: Le <a href="@url" title="Plus d'informations sur la page des paramètres de AES">mot de passe AES</a> a été désactivé

source: DataBase Email Encryption module disabled. Encryption is disabled now.
fr: Module DataBase Email Encryption désactivé. Le cryptage est désormais désactivé.

source: username or mail:
fr: nom d'utilisateur ou email:

source: You should disable this feature (uncheck 'Create AES passwords')
fr: Vous devriez désactiver cette fonctionnalité (décocher « Créer des mots de passe AES »)

source: It is not recommanded to enable it
fr: Il n'est pas recommandé de l'activer

source: Warning from the <em>Database Email Encryption</em> module : the AES <strong>passwords feature</strong> is not fonctionnal, it may be responsible of errors on creating or editing users. @disable_message.
fr: Avertissement issu du module <em>Database Email Encryption</em> : la <strong>fonctionnalité de mots de passe</strong> AES n'est pas stable, elle pourrait être responsable d'erreurs lors de la création ou de la modification d'utilisateurs. @disable_message.

source: This name has already been taken by another user.
fr: Ce nom est déjà été pris par un autre utilisateur.

source: This e-mail has already been taken by another user.
fr: Cet email a déjà été pris par un autre utilisateur.

source: DataBase Email Encryption settings
fr: Paramètres de DataBase Email Encryption

source: Module install: Attempt to recreate field: "@field", when it already exists.
fr: Installation de module : Tente de recréer le champ :"@field", alors qu'il existe déjà.

source: Encrypt user email addresses stored into the core database for security reasons. This module doesn't alter user experience
fr: Crypte l'adresse email des utilisateurs au sein de la base de données pour des raisons de sécurité. Ce module de modifie pas l'utilisation du site
